OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f66j60.h
extern __at(0x0EA6) __sfr MAIPG;
extern __at(0x0EA6) __sfr MAIPGL;
extern __at(0x0EA7) __sfr MAIPGH;
extern __at(0x0EAA) __sfr MAMXFL;
extern __at(0x0EAA) __sfr MAMXFLL;
extern __at(0x0EAB) __sfr MAMXFLH;

//==============================================================================
//        MICMD Bits

extern __at(0x0EB2) __sfr MICMD;

typedef struct
  {
  unsigned MIIRD                : 1;
  unsigned MIISCAN              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __MICMDbits_t;

extern __at(0x0EB2) volatile __MICMDbits_t MICMDbits;

#define _MIIRD                  0x01
#define _MIISCAN                0x02

//==============================================================================

extern __at(0x0EB4) __sfr MIREGADR;
extern __at(0x0EB6) __sfr MIWR;
extern __at(0x0EB6) __sfr MIWRL;
extern __at(0x0EB7) __sfr MIWRH;
extern __at(0x0EB8) __sfr MIRD;
extern __at(0x0EB8) __sfr MIRDL;
extern __at(0x0EB9) __sfr MIRDH;
extern __at(0x0EC0) __sfr EHT0;
extern __at(0x0EC1) __sfr EHT1;
extern __at(0x0EC2) __sfr EHT2;
extern __at(0x0EC3) __sfr EHT3;
extern __at(0x0EC4) __sfr EHT4;
extern __at(0x0EC5) __sfr EHT5;
extern __at(0x0EC6) __sfr EHT6;
extern __at(0x0EC7) __sfr EHT7;
extern __at(0x0EC8) __sfr EPMM0;
extern __at(0x0EC9) __sfr EPMM1;
extern __at(0x0ECA) __sfr EPMM2;
extern __at(0x0ECB) __sfr EPMM3;
extern __at(0x0ECC) __sfr EPMM4;
extern __at(0x0ECD) __sfr EPMM5;
extern __at(0x0ECE) __sfr EPMM6;
extern __at(0x0ECF) __sfr EPMM7;
extern __at(0x0ED0) __sfr EPMCS;
extern __at(0x0ED0) __sfr EPMCSL;
extern __at(0x0ED1) __sfr EPMCSH;
extern __at(0x0ED4) __sfr EPMO;
extern __at(0x0ED4) __sfr EPMOL;
extern __at(0x0ED5) __sfr EPMOH;

//==============================================================================
//        ERXFCON Bits

extern __at(0x0ED8) __sfr ERXFCON;

typedef struct
  {
  unsigned BCEN                 : 1;
  unsigned MCEN                 : 1;
  unsigned HTEN                 : 1;
  unsigned MPEN                 : 1;
  unsigned PMEN                 : 1;
  unsigned CRCEN                : 1;
  unsigned ANDOR                : 1;
  unsigned UCEN                 : 1;
  } __ERXFCONbits_t;

extern __at(0x0ED8) volatile __ERXFCONbits_t ERXFCONbits;

#define _BCEN                   0x01
#define _MCEN                   0x02
#define _HTEN                   0x04
#define _MPEN                   0x08
#define _PMEN                   0x10
#define _CRCEN                  0x20
#define _ANDOR                  0x40
#define _UCEN                   0x80

//==============================================================================

extern __at(0x0ED9) __sfr EPKTCNT;
extern __at(0x0EE2) __sfr EWRPT;
extern __at(0x0EE2) __sfr EWRPTL;
extern __at(0x0EE3) __sfr EWRPTH;
extern __at(0x0EE4) __sfr ETXST;
extern __at(0x0EE4) __sfr ETXSTL;
extern __at(0x0EE5) __sfr ETXSTH;
extern __at(0x0EE6) __sfr ETXND;
extern __at(0x0EE6) __sfr ETXNDL;
extern __at(0x0EE7) __sfr ETXNDH;
extern __at(0x0EE8) __sfr ERXST;
extern __at(0x0EE8) __sfr ERXSTL;
extern __at(0x0EE9) __sfr ERXSTH;
extern __at(0x0EEA) __sfr ERXND;
extern __at(0x0EEA) __sfr ERXNDL;
extern __at(0x0EEB) __sfr ERXNDH;
extern __at(0x0EEC) __sfr ERXRDPT;
extern __at(0x0EEC) __sfr ERXRDPTL;
extern __at(0x0EED) __sfr ERXRDPTH;
extern __at(0x0EEE) __sfr ERXWRPT;
extern __at(0x0EEE) __sfr ERXWRPTL;
extern __at(0x0EEF) __sfr ERXWRPTH;
extern __at(0x0EF0) __sfr EDMAST;
extern __at(0x0EF0) __sfr EDMASTL;
extern __at(0x0EF1) __sfr EDMASTH;
extern __at(0x0EF2) __sfr EDMAND;
extern __at(0x0EF2) __sfr EDMANDL;
extern __at(0x0EF3) __sfr EDMANDH;
extern __at(0x0EF4) __sfr EDMADST;
extern __at(0x0EF4) __sfr EDMADSTL;
extern __at(0x0EF5) __sfr EDMADSTH;
extern __at(0x0EF6) __sfr EDMACS;
extern __at(0x0EF6) __sfr EDMACSL;
extern __at(0x0EF7) __sfr EDMACSH;

//==============================================================================
//        EIE Bits

extern __at(0x0EFB) __sfr EIE;

typedef union
  {
  struct
    {
    unsigned RXERIE             : 1;
    unsigned TXERIE             : 1;
    unsigned                    : 1;
    unsigned TXIE               : 1;
    unsigned LINKIE             : 1;
    unsigned DMAIE              : 1;
    unsigned PKTIE              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ETXIE              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __EIEbits_t;

extern __at(0x0EFB) volatile __EIEbits_t EIEbits;

#define _RXERIE                 0x01
#define _TXERIE                 0x02
#define _TXIE                   0x08
#define _ETXIE                  0x08
#define _LINKIE                 0x10
#define _DMAIE                  0x20
#define _PKTIE                  0x40

//==============================================================================


//==============================================================================
//        ESTAT Bits

extern __at(0x0EFD) __sfr ESTAT;

typedef struct
  {
  unsigned PHYRDY               : 1;
  unsigned TXABRT               : 1;
  unsigned RXBUSY               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned BUFER                : 1;
  unsigned                      : 1;
  } __ESTATbits_t;

extern __at(0x0EFD) volatile __ESTATbits_t ESTATbits;

#define _PHYRDY                 0x01
#define _TXABRT                 0x02
#define _RXBUSY                 0x04
#define _BUFER                  0x40

//==============================================================================


//==============================================================================
//        ECON2 Bits

extern __at(0x0EFE) __sfr ECON2;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned ETHEN                : 1;
  unsigned PKTDEC               : 1;
  unsigned AUTOINC              : 1;
  } __ECON2bits_t;

